Unter/app/controllers/journeys_controller.rb

SELECT "journeys".* FROM "journeys"
---
  def index
    @journeys = Journey.all