app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"
---
  def index
    @cars = Car.all

INSERT INTO "cars" ("brand", "seats", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brand", "toyota"], ["seats", 3], ["user_id", 1], ["created_at", "2015-12-07 10:59:26.629167"], ["updated_at", "2015-12-07 10:59:26.629167"]]
---
  def create
    @car = Car.new(car_params) do |car|
      car.user = current_user
    end
    respond_to do |format|
      if @car.save

UPDATE "cars" SET "seats" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["seats", 4], ["updated_at", "2015-12-07 11:16:17.031610"], ["id", 3]]
---
    def update
      respond_to do |format|
        if @car.update(car_params)

DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]
---
    def destroy
      @car.destroy

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_car
      @car = Car.find(params[:id])