app/controllers/feedbacks_controller.rb

  def index
    @feedbacks = Feedback.all
---
SELECT "feedbacks".* FROM "feedbacks"

  def create
    @feedback = Feedback.new(feedback_params)

    respond_to do |format|
      if @feedback.save
---
INSERT INTO "feedbacks" ("passenger_id", "comment", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["passenger_id", 4], ["comment", "gfjygkjkjhjkhjhghgfgh"], ["rating", 9], ["created_at", "2015-12-06 18:37:11.205443"], ["updated_at", "2015-12-06 18:37:11.205443"]]

  def destroy
    @feedback.destroy
---
DELETE FROM "feedbacks" WHERE "feedbacks"."id" = ?  [["id", 1]]

    def set_feedback
      @feedback = Feedback.find(params[:id])
---
SELECT  "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT 1  [["id", 1]]