app/controllers/journeys_controller.rb

  def index
    @journeys = Journey.all
---
SELECT "journeys".* FROM "journeys"